# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
f_1=pd.Series(np.random.randint(1, 5, 100))
f_2=pd.Series(np.random.randint(1, 4, 100))
f_3=pd.Series(np.random.randint(10000, 30001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
df=pd.concat([f_1,f_2,f_3],axis=1)
df

    0  1      2
0   1  3  24754
1   3  3  28673
2   4  3  15416
3   2  3  17832
4   1  2  27529
.. .. ..    ...
95  3  1  13038
96  1  2  20256
97  2  1  24712
98  2  3  28532
99  2  3  11009

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       3            24754
1      3       3            28673
2      4       3            15416
3      2       3            17832
4      1       2            27529

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [15]:
bigcolumn = pd.concat([f_1, f_2, f_3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       1
1       3
2       4
3       2
4       1
..    ...
95  13038
96  20256
97  24712
98  28532
99  11009

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [16]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [ ]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn